Revit 2024 API
StairsRunType.HasRisers Property
 True if the stairs run will include risers on steps, false otherwise.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool HasRisers { get; set; }
Visual Basic
Public Property HasRisers As Boolean
	Get
	Set
Visual C++
public:
property bool HasRisers {
	bool get ();
	void set (bool value);
}
See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace